#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_policy.lambda_goodnight_stop_my_instances will be created
  + resource "aws_iam_policy" "lambda_goodnight_stop_my_instances" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + name   = "yama-dev-env-lambda-goodnight-stop-my-instances"
      + path   = "/yama-dev-env/"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "ec2:StopInstances"
                      + Condition = {
                          + StringEquals = {
                              + ec2:ResourceTag/Author = "yamaguti-dxa"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:ec2:*:*:instance/*"
                      + Sid       = "yama-dev-env-lambda-goodnight-allow-stop-my-instances"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # aws_iam_role_policy_attachment.goodnight_stop_my_instances will be created
  + resource "aws_iam_role_policy_attachment" "goodnight_stop_my_instances" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "yama-dev-env-lambda-goodnight"
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>

*Workflow: `dev-env.terraform.ci-pr`, Action: `hashicorpterraform-github-actions3`, Working Directory: `./dev-env/terraform`, Workspace: `default`*
